Repository: DiamantTh/Quicstar
Catalog: src/quicstar/locales/*/LC_MESSAGES/quicstar.po
Languages: de, es, fr, ja, zh

source: Lightweight HTTP/3 server with TOML configuration and Traefik-friendly defaults.
de: Leichter HTTP/3-Server mit TOML-Konfiguration und Traefik-kompatiblen Defaults.
es: Servidor HTTP/3 ligero con configuracion TOML y defaults compatibles con Traefik.
fr: Serveur HTTP/3 leger avec configuration TOML et defaults compatibles Traefik.
ja: 軽量なHTTP/3サーバー。TOML設定とTraefik向けデフォルトを備える。
zh: Qingliang HTTP/3 fuwuqi, TOML peizhi he Traefik you hao moren.

source: Path to a TOML file (standalone mode)
de: Pfad zu einer TOML-Datei (Standalone-Modus)
es: Ruta a un archivo TOML (modo standalone)
fr: Chemin vers un fichier TOML (mode autonome)
ja: TOMLファイルへのパス（スタンドアロンモード）
zh: TOML wenjian de lujing (duli moshi)

source: Host/IP to bind HTTP
de: Host/IP fuer den HTTP-Bind
es: Host/IP para el bind HTTP
fr: Hote/IP pour le bind HTTP
ja: HTTPでバインドするホスト/IP
zh: HTTP bangding de host/IP

source: Port to bind HTTP
de: Port fuer den HTTP-Bind
es: Puerto para el bind HTTP
fr: Port pour le bind HTTP
ja: HTTPでバインドするポート
zh: HTTP bangding de duankou

source: ASGI path, e.g. myproject.asgi:application
de: ASGI-Pfad, z. B. myproject.asgi:application
es: Ruta ASGI, p. ej. myproject.asgi:application
fr: Chemin ASGI, ex. myproject.asgi:application
ja: ASGIパス（例: myproject.asgi:application）
zh: ASGI lujing, li ru myproject.asgi:application

source: Protocol selection (HTTP/3, HTTP/1.1 only, or automatic)
de: Protokollwahl (HTTP/3, nur HTTP/1.1 oder automatisch)
es: Seleccion de protocolo (HTTP/3, solo HTTP/1.1 o automatico)
fr: Selection du protocole (HTTP/3, HTTP/1.1 seul ou automatique)
ja: プロトコル選択（HTTP/3、HTTP/1.1のみ、または自動）
zh: Xieyi xuanze (HTTP/3, zhiyou HTTP/1.1, huozhe zidong)

source: Number of worker processes
de: Anzahl der Worker-Prozesse
es: Numero de procesos worker
fr: Nombre de processus worker
ja: ワーカープロセス数
zh: Worker jincheng shu

source: Disable access logs
de: Access-Logs deaktivieren
es: Desactivar access logs
fr: Desactiver les access logs
ja: アクセスログを無効化
zh: Jinyong access log

source: Log level
es: Nivel de log
fr: Niveau de log
ja: ログレベル
zh: Rizhi dengji

source: TLS certificate (required for HTTP/3)
de: TLS Zertifikat (erforderlich fuer HTTP/3)
es: Certificado TLS (requerido para HTTP/3)
fr: Certificat TLS (requis pour HTTP/3)
ja: TLS証明書（HTTP/3に必須）
zh: TLS zhengshu (HTTP/3 bixu)

source: TLS key (required for HTTP/3)
de: TLS Key (erforderlich fuer HTTP/3)
es: Clave TLS (requerida para HTTP/3)
fr: Cle TLS (requise pour HTTP/3)
ja: TLS秘密鍵（HTTP/3に必須）
zh: TLS miyao (HTTP/3 bixu)

source: Optional QUIC bind, e.g. '0.0.0.0:443'
de: Optionaler QUIC-Bind, z. B. '0.0.0.0:443'
es: Bind QUIC opcional, p. ej. '0.0.0.0:443'
fr: Bind QUIC optionnel, ex. '0.0.0.0:443'
ja: 任意のQUICバインド（例: '0.0.0.0:443'）
zh: Kexuan QUIC bangding, li ru '0.0.0.0:443'

source: protocol_mode must be one of: auto, http3, http1
de: protocol_mode muss eine dieser Optionen sein: auto, http3, http1
es: protocol_mode debe ser: auto, http3 o http1
fr: protocol_mode doit etre: auto, http3 ou http1
ja: protocol_mode は auto/http3/http1 のいずれかにしてください
zh: protocol_mode ying wei auto/http3/http1 qi zhong yi ge

source: TLS certificate (certfile) is required for HTTP/3.
de: Fuer HTTP/3 muss ein TLS-Zertifikat (certfile) angegeben werden.
es: Se requiere un certificado TLS (certfile) para HTTP/3.
fr: Un certificat TLS (certfile) est requis pour HTTP/3.
ja: HTTP/3 には TLS 証明書 (certfile) が必要です。
zh: HTTP/3 xuyao TLS zhengshu (certfile).

source: If a keyfile is set, a certfile must also be provided.
de: Wenn ein keyfile gesetzt ist, muss auch ein certfile angegeben werden.
es: Si se define keyfile, tambien se debe definir certfile.
fr: Si un keyfile est defini, un certfile doit aussi etre defini.
ja: keyfile を設定する場合、certfile も必要です。
zh: She zhi keyfile shi bixu tongshi she zhi certfile.

source: If a certfile is set, a keyfile must also be provided.
de: Wenn ein certfile gesetzt ist, muss auch ein keyfile angegeben werden.
es: Si se define certfile, tambien se debe definir keyfile.
fr: Si un certfile est defini, un keyfile doit aussi etre defini.
ja: certfile を設定する場合、keyfile も必要です。
zh: She zhi certfile shi bixu tongshi she zhi keyfile.
